IDENTIFICATION DIVISION.
       PROGRAM-ID. "GuessNumber".
       AUTHOR.     "Daniel Thornton".
     *This program is a guess the number game.
       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       DATA DIVISION
